test/cwmp_builder_SUITE_data/cwmp_AutonomousTransferComplete.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:AutonomousTransferComplete><AnnounceURL>http://announceURL-FwUpgr/</AnnounceURL><TransferURL>http://transferURL-FwUpgr/</TransferURL><IsDownload>true</IsDownload><DownloadFileType>1</DownloadFileType><FileSize>12345</FileSize><TargetFileName/><cwmp:TransferCompleteFaultStruct><FaultCode>0</FaultCode><FaultString/></cwmp:TransferCompleteFaultStruct><StartTime>2012-10-03T18:53:34Z</StartTime><CompleteTime>2012-10-03T18:53:44Z</CompleteTime></cwmp:AutonomousTransferComplete></soapenv:Body></soapenv:Envelope>